ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6_FUTURE/serial_api.c
const PinMap *serial_rts_pinmap()
{
    return PinMap_UART_RTS;
}

#if DEVICE_SERIAL_ASYNCH

void serial_irq_handler(serial_t *obj_in, uart_irq_handler handler, uint32_t id)
{
    serial_obj_t *obj = OBJ_P(obj_in);
    irq_info_t *info = &irq_info[obj->serial_id];

    if (info->irqn != unconnected_IRQn) {
        NVIC_DisableIRQ(info->irqn);
    }
    info->handler = handler;
    info->id_arg = id;
    serial_irq_setup_channel(obj);
}

void serial_irq_set(serial_t *obj_in, SerialIrq irq, uint32_t enable)
{
    serial_obj_t *obj = OBJ_P(obj_in);

    switch (irq) {
        case RxIrq:
            if (enable) {
                Cy_SCB_SetRxInterruptMask(obj->base,  CY_SCB_RX_INTR_NOT_EMPTY);
            } else {
                Cy_SCB_SetRxInterruptMask(obj->base, 0);
            }
            break;
        case TxIrq:
            if (enable) {
                Cy_SCB_SetTxInterruptMask(obj->base, CY_SCB_TX_INTR_LEVEL | CY_SCB_UART_TX_DONE);
            } else {
                Cy_SCB_SetTxInterruptMask(obj->base, 0);
            }
            break;
    }
}

static void serial_finish_tx_asynch(serial_obj_t *obj)
{
    Cy_SCB_SetTxInterruptMask(obj->base, 0);
    obj->tx_pending = false;
}

static void serial_finish_rx_asynch(serial_obj_t *obj)
{
    Cy_SCB_SetRxInterruptMask(obj->base, 0);
    obj->rx_pending = false;
}

int serial_tx_asynch(serial_t *obj_in, const void *tx, size_t tx_length, uint8_t tx_width, uint32_t handler, uint32_t event, DMAUsage hint)
{
    serial_obj_t *obj = OBJ_P(obj_in);
    const uint8_t *p_buf = tx;

    (void)tx_width; // Obsolete argument
    (void)hint; // At the moment we do not support DAM transfers, so this parameter gets ignored.

    if (obj->tx_pending) {
        return 0;
    }

    obj->tx_events = event;
    obj->async_handler = (cy_israddress)handler;
    if (serial_irq_setup_channel(obj) < 0) {
        return 0;
    }

    // Write as much as possible into the FIFO first.
    while ((tx_length > 0) && Cy_SCB_UART_Put(obj->base, *p_buf)) {
        ++p_buf;
        --tx_length;
    }

    if (tx_length > 0) {
        obj_in->tx_buff.buffer = (void *)p_buf;
        obj_in->tx_buff.length = tx_length;
        obj_in->tx_buff.pos = 0;
        obj->tx_pending = true;
        // Enable interrupts to complete transmission.
        Cy_SCB_SetTxInterruptMask(obj->base, CY_SCB_TX_INTR_LEVEL | CY_SCB_UART_TX_DONE);

    } else {
        // Enable interrupt to signal completing of the transmission.
        Cy_SCB_SetTxInterruptMask(obj->base, CY_SCB_UART_TX_DONE);
    }
    return tx_length;
}

void serial_rx_asynch(serial_t *obj_in, void *rx, size_t rx_length, uint8_t rx_width, uint32_t handler, uint32_t event, uint8_t char_match, DMAUsage hint)
{
    serial_obj_t *obj = OBJ_P(obj_in);

    (void)rx_width; // Obsolete argument
    (void)hint; // At the moment we do not support DAM transfers, so this parameter gets ignored.

    if (obj->rx_pending || (rx_length == 0)) {
        return;
    }

    obj_in->char_match = char_match;
    obj_in->char_found = false;
    obj->rx_events = event;
    obj_in->rx_buff.buffer = rx;
    obj_in->rx_buff.length = rx_length;
    obj_in->rx_buff.pos = 0;
    obj->async_handler = (cy_israddress)handler;
    if (serial_irq_setup_channel(obj) < 0) {
        return;
    }
    obj->rx_pending = true;
    // Enable interrupts to start receiving.
    Cy_SCB_SetRxInterruptMask(obj->base, CY_SCB_UART_RX_INTR_MASK & ~CY_SCB_RX_INTR_UART_BREAK_DETECT);
}

uint8_t serial_tx_active(serial_t *obj)
{
    return obj->serial.tx_pending;
}

uint8_t serial_rx_active(serial_t *obj)
{
    return obj->serial.rx_pending;
}

int serial_irq_handler_asynch(serial_t *obj_in)
{
    uint32_t cur_events = 0;
    uint32_t tx_status;
    uint32_t rx_status;

    serial_obj_t *obj = OBJ_P(obj_in);

    rx_status = Cy_SCB_GetRxInterruptStatusMasked(obj->base);

    tx_status = Cy_SCB_GetTxInterruptStatusMasked(obj->base);


    if (tx_status & CY_SCB_TX_INTR_LEVEL) {
        // FIFO has space available for more TX
        uint8_t *ptr = obj_in->tx_buff.buffer;
        ptr += obj_in->tx_buff.pos;
        while ((obj_in->tx_buff.pos < obj_in->tx_buff.length) &&
                Cy_SCB_UART_Put(obj->base, *ptr)) {
            ++ptr;
            ++(obj_in->tx_buff.pos);
        }
        if (obj_in->tx_buff.pos == obj_in->tx_buff.length) {
            // No more bytes to follow; check to see if we need to signal completion.
            if (obj->tx_events & SERIAL_EVENT_TX_COMPLETE) {
                // Disable FIFO interrupt as there are no more bytes to follow.
                Cy_SCB_SetTxInterruptMask(obj->base, CY_SCB_UART_TX_DONE);
            } else {
                // Nothing more to do, mark end of transmission.
                serial_finish_tx_asynch(obj);
            }
        }
    }

    if (tx_status & CY_SCB_TX_INTR_UART_DONE) {
        // Mark end of the transmission.
        serial_finish_tx_asynch(obj);
        cur_events |= SERIAL_EVENT_TX_COMPLETE & obj->tx_events;
    }

    Cy_SCB_ClearTxInterrupt(obj->base, tx_status);

    if (rx_status & CY_SCB_RX_INTR_OVERFLOW) {
        cur_events |= SERIAL_EVENT_RX_OVERRUN_ERROR & obj->rx_events;
    }

    if (rx_status & CY_SCB_RX_INTR_UART_FRAME_ERROR) {
        cur_events |= SERIAL_EVENT_RX_FRAMING_ERROR & obj->rx_events;
    }

    if (rx_status & CY_SCB_RX_INTR_UART_PARITY_ERROR) {
        cur_events |= SERIAL_EVENT_RX_PARITY_ERROR & obj->rx_events;
    }

    if (rx_status & CY_SCB_RX_INTR_LEVEL) {
        uint8_t *ptr = obj_in->rx_buff.buffer;
        ptr += obj_in->rx_buff.pos;
        uint32_t fifo_cnt = Cy_SCB_UART_GetNumInRxFifo(obj->base);
        while ((obj_in->rx_buff.pos < obj_in->rx_buff.length) && fifo_cnt) {
            uint32_t c = Cy_SCB_UART_Get(obj->base);
            *ptr++ = (uint8_t)c;
            ++(obj_in->rx_buff.pos);
            --fifo_cnt;
            // Check for character match condition.
            if (obj_in->char_match != SERIAL_RESERVED_CHAR_MATCH) {
                if (c == obj_in->char_match) {
                    obj_in->char_found = true;
                    cur_events |= SERIAL_EVENT_RX_CHARACTER_MATCH & obj->rx_events;
                    // Clamp RX.
                    obj_in->rx_buff.length = obj_in->rx_buff.pos;
                    break;
                }
            }
        }
        if (obj_in->rx_buff.pos == obj_in->rx_buff.length) {
            cur_events |= SERIAL_EVENT_RX_COMPLETE & obj->rx_events;
        }
    }

    // Any event should end operation.
    if (cur_events & SERIAL_EVENT_RX_ALL) {
        serial_finish_rx_asynch(obj);
    }

    Cy_SCB_ClearRxInterrupt(obj->base, rx_status);

    return cur_events;
}

void serial_tx_abort_asynch(serial_t *obj_in)
{
    serial_obj_t *obj = OBJ_P(obj_in);

    serial_finish_tx_asynch(obj);
    Cy_SCB_UART_ClearTxFifo(obj->base);
}

void serial_rx_abort_asynch(serial_t *obj_in)
{
    serial_obj_t *obj = OBJ_P(obj_in);

    serial_finish_rx_asynch(obj);
    Cy_SCB_UART_ClearRxFifo(obj->base);
}

#endif // DEVICE_SERIAL_ASYNCH

#endif // DEVICE_SERIAL
